---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs
source: html/953d88a0-6bb3-13ad-1100-b0e8cee15aa2.htm
---
# ExternalDataInstanceRemovingFromDocumentEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.